#
#   ____                     __ _ _
#  | __ ) _ __ _____      __/ _(_) | ___
#  |  _ \| '__/ _ \ \ /\ / / |_| | |/ _ \
#  | |_) | | |  __/\ V  V /|  _| | |  __/
#  |____/|_|  \___| \_/\_/ |_| |_|_|\___|
#
#
# Mads Møller
# type: brew bundle

cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap "homebrew/bundle"
tap "homebrew/services"

# Binaries
brew 'curl'
brew 'git'
brew "git-lfs"
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'zsh-completions'
brew 'mas' # Mac App Store manager
brew 'wget'
brew 'graphicsmagick'
brew 'imagemagick'
brew "ghostscript"

# Development
brew 'php'
brew 'composer'
brew 'node'
cask 'sequel-pro'
cask 'postman'
cask 'sourcetree'
brew 'awscli'
cask 'docker'

# Editors
cask 'atom'
#brew 'visual-studio-code'
cask 'phpstorm'

# applications
cask 'slack'
cask 'vlc'
cask 'spotify'
cask 'google-chrome'
cask 'firefox'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'discord'

# media
cask 'imagealpha'
cask 'imageoptim'
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'

# quicklock plugins
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-devicons'
cask 'font-fontawesome'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-open-sans-condensed'
cask 'font-roboto'
cask 'font-libre-franklin'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
