#
#   ____                     __ _ _
#  | __ ) _ __ _____      __/ _(_) | ___
#  |  _ \| '__/ _ \ \ /\ / / |_| | |/ _ \
#  | |_) | | |  __/\ V  V /|  _| | |  __/
#  |____/|_|  \___| \_/\_/ |_| |_|_|\___|
#
#
# Mads Møller
# type: brew bundle

cask_args appdir: '/Applications'
tap 'homebrew/core'
tap 'caskroom/cask'
tap 'homebrew/php'
tap 'homebrew/dupes'
tap 'homebrew/completions'

brew 'wget'

#  Cask
# 'caskroom/cask/brew-cask'

#  Casks

# Development
cask 'java'
cask 'virtualbox'
cask 'vagrant'
cask 'iterm2'
cask 'phpstorm'
cask 'sequel-pro'
cask 'atom'
brew 'visual-studio-code'
cask 'postman'
cask 'sourcetree'
brew 'node'
brew 'awscli'

# Web Development
brew 'php71-xdebug'
brew 'composer'
brew 'php-cs-fixer'
brew 'yarn'
cask 'medis'

# Mobile dev
cask 'android-studio'
cask 'genymotion'
cask 'fastlane'

# command line
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'zsh-completions'
brew 'mas'

# applications
cask 'slack'
cask 'vlc'
cask 'clipmenu'
cask 'skype'
cask 'teamviewer'
cask 'spotify'
cask 'google-chrome'
cask 'firefox'
cask 'dropbox'
cask 'filezilla'

# quicklock plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'provisionql'
cask 'quicklookapk'
cask 'epubquicklook'
cask 'betterzipql'
cask 'webpquicklook'
cask 'suspicious-package'

# Fonts
tap 'caskroom/fonts'
cask 'font-devicons'
cask 'font-fontawesome'
cask 'font-open-sans'
cask 'font-open-sans-condensed'
cask 'font-roboto'

# App Store applications
mas 'Xcode', id: 497799835
mas 'Wunderlist', id: 410628904
mas 'vSSH', id: 583272886
mas 'Promotee', id: 578071639
mas 'PHP Runner', id: 686855602
