#
#   ____                     __ _ _
#  | __ ) _ __ _____      __/ _(_) | ___
#  |  _ \| '__/ _ \ \ /\ / / |_| | |/ _ \
#  | |_) | | |  __/\ V  V /|  _| | |  __/
#  |____/|_|  \___| \_/\_/ |_| |_|_|\___|
#
#
# Mads Møller
# type: brew bundle

cask_args appdir: '/Applications'

tap 'homebrew/core'
tap "homebrew/bundle"
tap "homebrew/services"
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'

# Binaries
brew 'curl'
brew 'git'
brew "git-lfs"
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'zsh-completions'
brew 'mas' # Mac App Store manager
brew 'wget'
brew 'graphicsmagick'
brew 'imagemagick'
brew "ghostscript"

#  Casks

# Development
brew 'php'
cask 'java'
brew 'node'
cask 'virtualbox'
cask 'vagrant'
cask 'sequel-pro'
cask 'postman'
cask 'sourcetree'
brew 'awscli'
cask 'charles'

# Editors
cask 'atom'
#brew 'visual-studio-code'
cask 'phpstorm'

# Web Development
cask 'docker'
brew 'composer'
brew 'php-cs-fixer'
brew 'yarn'
#cask 'medis'

# Mobile dev
cask 'android-studio'
cask 'fastlane'


# applications
cask 'slack'
cask 'vlc'
cask 'clipmenu'
cask 'skype'
cask 'teamviewer'
cask 'spotify'
cask 'google-chrome'
cask 'firefox'
cask 'dropbox'
cask 'filezilla'
cask 'the-unarchiver'
cask 'imagealpha'
cask 'imageoptim'

# LastPass is a password manager
cask 'lastpass'

# quicklock plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'provisionql'
cask 'quicklookapk'
cask 'epubquicklook'
cask 'betterzipql'
cask 'webpquicklook'
cask 'suspicious-package'

# Fonts
cask 'font-devicons'
cask 'font-fontawesome'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-open-sans-condensed'
cask 'font-roboto'
cask 'font-exo'
cask 'font-exo2'
cask 'font-libre-franklin'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# App Store applications
mas 'Xcode', id: 497799835
mas 'Wunderlist', id: 410628904
mas 'vSSH', id: 583272886
mas 'Promotee', id: 578071639
mas 'PHP Runner', id: 686855602
mas "io.realm.realmbrowser", id: 1007457278
